#include <allfunc.h>

void page190(int *idx)
{
	struct bottom b1,b2,b3;
	int flag=0;
	
	draw_bg(0);
	/*
电动自行车登记注册承诺书

本人已熟知国家和地方的交通法律法规，全面了解所使用电动自行车的状况并承担使用该车带来的一切责任。为共同营造安全、文明、有序、宁静、和谐的校园交通环境，带头做到如下几点：
1.遵守交通规则，不闯红灯、不逆行、不超速；
2.骑行时不双手脱把、不使用手持电话等影响交通安全；
3.不搭载12周岁以上人员；
4.不酒后驾驶；
5.不对电动自行车进行加装或改装；
6.不使用电动自行车进行非法营运；
7.不进电梯，不停楼道，不在未施划非机动车停车位的区域停放；
8.不“飞线”充电或入室充电。
	*/ 
	
	draw_str(0.5,0.15,0xffff,"电动自行车登记注册承诺书");
	draw_str(0.5,0.25,0xffff,"本人已熟知国家和地方的交通法律法规，全面了解所使用电动自");
	draw_str(0.5,0.30,0xffff,"行车的状况并承担使用该车带来的一切责任。为共同营造安全、");
	draw_str(0.5,0.35,0xffff,"文明、有序、宁静、和谐的校园交通环境，带头做到如下几点：");
	draw_str(0.5,0.40,0xffff,"一：遵守交通规则，不闯红灯、不逆行、不超速；");
	draw_str(0.5,0.45,0xffff,"二：骑行时不双手脱把、不使用手持电话等影响交通安全；");
	draw_str(0.5,0.50,0xffff,"三：不搭载12周岁以上人员；");
	draw_str(0.5,0.55,0xffff,"四：不酒后驾驶；");
	draw_str(0.5,0.60,0xffff,"五：不对电动自行车进行加装或改装；");
	draw_str(0.5,0.65,0xffff,"六：不使用电动自行车进行非法营运；");
	draw_str(0.5,0.70,0xffff,"七：不进电梯，不停楼道，不在未施划非机动车停车位的区域停放；");
	draw_str(0.5,0.75,0xffff,"八：不“飞线”充电或入室充电。");
    
    b1=draw_bottom(0.15,0.05,0x1234,"返回上一级");
    b2=draw_bottom(0.5,0.85,0xe000,"我已知晓");  
    
    update_mouse(&mouse);
    
    while(!flag)   
	{
		mouse_show(&mouse);	
		if(click(&b1)) flag=102;
		else if(click(&b2)) flag=191;
	}
	*idx=flag;
}
